Autodesk.Revit.DB.ConnectorDomainType
Type of connector domain.
Enumeration of connector domain types

Autodesk.Revit.DB.ConnectorDomainType.StructuralAnalytical
Connector of Structural Analytical Model

Autodesk.Revit.DB.ConnectorDomainType.CableTrayConduit
Connector of cable trays or conduits

Autodesk.Revit.DB.ConnectorDomainType.Piping
Piping connector

Autodesk.Revit.DB.ConnectorDomainType.Electrical
Electrical connector

Autodesk.Revit.DB.ConnectorDomainType.Hvac
HVAC (duct) connector

Autodesk.Revit.DB.ConnectorDomainType.Undefined
Domain is undefined